sys/HastaKayıt.xml

<?xml version="1.0" encoding="UTF-8"?>

<s:Envelope
    xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    xmlns:xs="http://www.w3.org/2001/XMLSchema"
    xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing"
    xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
    xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
    <s:Header>
        <wsse:Security>
           <wsse:UsernameToken wsu:Id="SecurityToken-C740D028-8F1D-C45F-E0407C0A04162BDD">
                <wsse:Username><%=username %></wsse:Username>
                <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText"><%=Password %></wsse:Password>
            </wsse:UsernameToken>
        </wsse:Security>
     </s:Header>
    <s:Body>
         <SYSSendMessage xmlns="https://sys.sagliknet.saglik.gov.tr/SYS/">
          
      <input>
                &lt;SYSMessage&gt;
                    &lt;messageGuid value="<%=messageGuid %>" /&gt;
                    &lt;messageType version="1" codeSystemGuid="0a9ba485-e7e0-4abb-9c86-0a14fd364bb8" code="101" value="Hasta Kayıt" /&gt;
                    &lt;documentGenerationTime value="<%=documentGenerationTime %>" /&gt;
                    &lt;author&gt;
                        &lt;healthcareProvider version="1" codeSystemGuid="c3eade04-4f91-5dab-e043-14031b0ac9f9" code="<%=healthcareProviderCode %>" value="<%=healthcareProviderValue %>" /&gt;
                    &lt;/author&gt;
                    &lt;firmaKodu value="<%=firmaKodu %>" /&gt;
                    &lt;recordData&gt;
                        &lt;HASTA_KIMLIK_BILGILERI&gt;
                             <%if(BABA_KIMLIK_NUMARASI!=undefined){ %>
                               &lt;BABA_KIMLIK_NUMARASI value="<%=BABA_KIMLIK_NUMARASI %>" /&gt;
                            <%} %>
                          
                            <%if(GELDIGI_ULKE_KODU!=-1){ %>
                            &lt;GELDIGI_ULKE version="1" codeSystemGuid="d650777a-3d4d-a259-e040-7c0a01167a83" code="<%=GELDIGI_ULKE_KODU %>" value="<%=GELDIGI_ULKE_ADI %>" /&gt;
                            <%} %>
                            <%if(TELEFON_NUMARASI!=undefined){ %>
                            &lt;TELEFON_NUMARASI value="<%=TELEFON_NUMARASI %>" /&gt;
                            <%} %>
                            
                            &lt;HASTA_KIMLIK_NUMARASI value="<%=HASTA_KIMLIK_NUMARASI %>" /&gt;
                            &lt;AD value="<%=AD %>" /&gt;
                            &lt;SOYAD value="<%=SOYAD %>" /&gt;
                            &lt;DOGUM_TARIHI value="<%=DOGUM_TARIHI %>" /&gt;
                            &lt;CINSIYET version="1" codeSystemGuid="784d0f4f-0603-4425-937f-1a3941fc3a1f" code="<%=CINSIYET_KODU %>" value="<%=CINSIYET_ADI %>" /&gt;
                            &lt;UYRUK version="1" codeSystemGuid="d650777a-3d4d-a259-e040-7c0a01167a83" code="<%=UYRUK_KODU %>" value="<%=UYRUK_ADI %>" /&gt;
                            &lt;ANNE_KIMLIK_NUMARASI value="<%=ANNE_KIMLIK_NUMARASI%>" /&gt;
                            <%if(DOGUM_SIRASI!=undefined){ %>                           
                            &lt;DOGUM_SIRASI value="<%=DOGUM_SIRASI %>" /&gt;
                            <%} %>  
                            <%if(YABANCI_HASTA_KIMLIK_NUMARASI!=undefined){ %>       
                            &lt;YABANCI_HASTA_KIMLIK_NUMARASI value="<%=YABANCI_HASTA_KIMLIK_NUMARASI %>" /&gt;
                            <%} %> 
                            <%if(PASAPORT_NO!=undefined){ %> 
                            &lt;PASAPORT_NO value="<%=PASAPORT_NO %>" /&gt;
                            <%} %> 
                            <%if(KIMLIKSIZ_HASTA_BILGISI!=undefined){ %>
                            &lt;KIMLIKSIZ_HASTA_BILGISI value="<%=KIMLIKSIZ_HASTA_BILGISI %>" /&gt;
                             <%} %> 
                             <%if(BEYAN_DOGUM_TARIHI!=undefined){ %>
                            &lt;BEYAN_DOGUM_TARIHI value="<%=BEYAN_DOGUM_TARIHI %>" /&gt;
                             <%} %> 
                             <%if(HASTA_TIPI_KODU!=undefined){ %>
                            &lt;HASTA_TIPI version="1" codeSystemGuid="4f4fd85e-6f52-4c38-a302-6d5e3d6dc1c4" code="<%=HASTA_TIPI_KODU %>" value="<%=HASTA_TIPI_ADI %>" /&gt;
                            <%} %> 
                            <%if(EPOSTA_ADRESI!=undefined){ %>
                            &lt;EPOSTA_ADRESI value="<%=EPOSTA_ADRESI %>" /&gt;
                             <%} %> 
                             <%if(YABANCI_HASTA_TURU_KODU!=-1){ %>
                            &lt;YABANCI_HASTA_TURU version="1" codeSystemGuid="d8e52cb9-4aa9-512c-e043-14031b0a419d" code="<%=YABANCI_HASTA_TURU_KODU %>" value="<%=YABANCI_HASTA_TURU_ADI %>" /&gt;
                            <%} %> 
                            <%if(YUPASS_NO!=-1){ %>
                            &lt;YUPASS_NO value="<%=YUPASS_NO %>" /&gt;
                             <%} %>
                            &lt;ADRES_BILGISI&gt;
                                &lt;ADRES_KODU_SEVIYESI version="1" codeSystemGuid="aa0e83ba-e9db-4817-80da-577fd6a17373" code="4" value="KÖY" /&gt;
                                &lt;ADRES_KODU value="" /&gt;
                                &lt;ACIK_ADRES value="" /&gt;
                                &lt;ACIK_ADRES_ILCE value="" /&gt;
                            &lt;/ADRES_BILGISI&gt;
                        &lt;/HASTA_KIMLIK_BILGILERI&gt;   
                        &lt;HASTA_BASVURU_BILGILERI&gt;  
                             &lt;HIZMET_SUNUCU version="1" codeSystemGuid="c3eade04-4f91-5dab-e043-14031b0ac9f9" code="999900" value="TEST AİLE HEKİMLİĞİ" /&gt;
                             &lt;KAYIT_YERI version="1" codeSystemGuid="c3eade04-4f91-5dab-e043-14031b0ac9f9" code="388" value="TEST DEVLET HASTAHANESİ" /&gt;
                              &lt;SGK_TAKIP_NUMARASI value="SGK_TAKIP_NUMARASI" /&gt;
                               &lt;KABUL_ZAMANI value="201803291408" /&gt;
                             &lt;KLINIK_KODU version="1" codeSystemGuid="c04bee57-c5d4-443d-e040-7b0a6f146a3d" code="157" value="İÇ HASTALIKLARI" /&gt;
                             &lt;HASTANE_REFERANS_NUMARASI value="<%=HASTANE_REFERANS_NUMARASI %>" /&gt; 
                                &lt;SOSYAL_GUVENCE_DURUMU version="1" codeSystemGuid="530da738-2be0-4adc-a7c1-aca18c66a3f8" code="31" value="" /&gt;
                            &lt;SYSTakipNo value="" /&gt;  
                             &lt;VAKA_TURU version="1" codeSystemGuid="46380e82-d8b1-407d-9554-255d95a9f959" code="1" value="" /&gt;
                            &lt;MHRS_RANDEVU_NUMARASI value="MHRS_RANDEVU_NUMARASI" /&gt;
                           &lt;HEKIM_KIMLIK_NUMARASI value="99999999990" /&gt;
                           &lt;YATIS_BILGISI&gt;
                                &lt;YATIS_KABUL_ZAMANI value="" /&gt;
                                &lt;YATAK_NO value="" /&gt;
                                &lt;YATIS_GUNUBIRLIK_MI value="" /&gt;
                                &lt;YATISIN_ACILIYETI version="1" codeSystemGuid="dc6ff680-555f-44b2-855e-a47c51207e4f" code="1" value="YATISIN_ACILIYETI" /&gt;
                            &lt;/YATIS_BILGISI&gt;
                        &lt;/HASTA_BASVURU_BILGILERI&gt;                   
                    &lt;/recordData&gt;
                &lt;/SYSMessage&gt;
               </input>
            </SYSSendMessage>
            </s:Body>
    </s:Envelope>